app/views/scores/_form.html.erb

          <% if current_user.admin? %>
            <%= f.input :user_id, collection: [options_for_select(User.all.map{ |u| [u.firstname, u.id]})] %>
---
SELECT "users".* FROM "users"