app/views/scores/show.html.erb

 		<div>
  		<h2><%= @score.user.firstname %> <%= @score.user.lastname %></h2>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1