app/views/pages/students.html.erb

SELECT COUNT(*) FROM "scores" WHERE "scores"."user_id" = ?  [["user_id", 1]]
---
					<td>
						<h3><%= user.scores.count %></h3>

SELECT "users".* FROM "users"
---

<%= pie_chart User.group(:firstname).count %>