app/controllers/pages_controller.rb

  def students
  	if current_user.admin?
  		@users = User.all
---
SELECT "users".* FROM "users"