app/controllers/scores_controller.rb

SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT 1  [["id", "show"]]
---
  def show
    @score = Score.find(params[:id])

INSERT INTO "scores" ("created_at", "name", "test_type", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 16 Aug 2014 13:43:42 UTC +00:00], ["name", "SAT"], ["test_type", "Practice"], ["updated_at", Sat, 16 Aug 2014 13:43:42 UTC +00:00], ["user_id", 1]]
---
	def create
    @score = current_user.scores.new(params[:score])
    @user = current_user

    respond_to do |format|
      if @score.save

SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "scores" SET "user_id" = ?, "reading" = ?, "math" = ?, "writing" = ?, "essay" = ?, "taken_date" = ?, "updated_at" = ? WHERE "scores"."id" = 26  [["user_id", nil], ["reading", 600], ["math", 750], ["writing", 400], ["essay", 30], ["taken_date", Sun, 24 Aug 2014], ["updated_at", Sun, 24 Aug 2014 14:10:09 UTC +00:00]]
---
  def update
  	@score = Score.find(params[:id])

    respond_to do |format|
      if @score.update(params[:score])

SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
  	@score = Score.find(params[:id])

SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "scores" WHERE "scores"."id" = ?  [["id", 1]]
---
  def destroy
    @score = Score.find(params[:id])
    if @score.present?
      @score.destroy