app/controllers/users_controller.rb

  def show
  	if User.find(params[:id]) == current_user || current_user.admin?
  		@user = User.find(params[:id])
  		@scores = @user.scores
  		@score_act = @scores.where(:name => 'ACT')
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
SELECT "scores".* FROM "scores" WHERE "scores"."user_id" = ? AND ("scores"."name" != 'ACT')  [["user_id", 1]]